package questions

import "ggame/backend/internal/models"

var bank = []models.Question{
	// ================== 9 КЛАСС ==================
	{ID: "q9-1", Grade: 9, Topic: "Логика", Text: "В комнате три выключателя, только один включает лампочку в соседней комнате. Вы можете заходить в комнату с лампочкой только один раз. Как определить нужный выключатель?", Options: []string{"Включить первый на 5 минут, выключить, включить второй и зайти", "Включить все три и зайти", "Позвать друга", "По очереди включать и смотреть под дверь"}, CorrectAnswer: 0, Explanation: "Включаем первый на время (лампа нагреется), выключаем, включаем второй и заходим. Горящая – второй, тёплая – первый, холодная – третий.", TimeLimitSeconds: 90, Difficulty: 2},
	{ID: "q9-2", Grade: 9, Topic: "Алгоритмы", Text: "Робот стоит в начале лабиринта 3×3. Он может двигаться только вправо и вниз. Сколько различных путей ведут в противоположный угол?", Options: []string{"4", "6", "8", "12"}, CorrectAnswer: 1, Explanation: "Нужно сделать 2 шага вправо и 2 вниз. Число комбинаций C(4,2)=6.", TimeLimitSeconds: 60, Difficulty: 1},
	{ID: "q9-3", Grade: 9, Topic: "Кодирование", Text: "Какое минимальное количество бит потребуется, чтобы закодировать 33 различных символа?", Options: []string{"5", "6", "8", "33"}, CorrectAnswer: 1, Explanation: "2^5=32 (мало), 2^6=64. Нужно 6 бит.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q9-4", Grade: 9, Topic: "Логика", Text: "Если все программисты — разработчики, а некоторые разработчики — геймеры, то обязательно ли некоторые программисты — геймеры?", Options: []string{"Да", "Нет", "Зависит от компании", "Только в выходные"}, CorrectAnswer: 1, Explanation: "Из «все программисты – разработчики» и «некоторые разработчики – геймеры» не следует, что эти «некоторые» обязательно программисты.", TimeLimitSeconds: 75, Difficulty: 2},
	{ID: "q9-5", Grade: 9, Topic: "Системы счисления", Text: "Чему равно 1101₂ + 15₈ в десятичной системе?", Options: []string{"24", "26", "28", "30"}, CorrectAnswer: 1, Explanation: "1101₂ = 13, 15₈ = 13. Сумма 26.", TimeLimitSeconds: 75, Difficulty: 2},
	{ID: "q9-6", Grade: 9, Topic: "Логика", Text: "У Пети есть 3 коробки: в одной процессор, в другой кулер, в третья термопаста. Надписи на всех коробках ложны. На первой: «Здесь процессор». На второй: «Здесь не процессор». На третьей: «Здесь кулер». Где процессор?", Options: []string{"В первой", "Во второй", "В третьей", "Ни в одной"}, CorrectAnswer: 1, Explanation: "Если надпись на второй ложна, значит процессор именно во второй.", TimeLimitSeconds: 80, Difficulty: 2},
	{ID: "q9-7", Grade: 9, Topic: "Графы", Text: "В компьютерной сети 4 устройства, каждое соединено с каждым. Сколько всего соединений?", Options: []string{"4", "6", "8", "12"}, CorrectAnswer: 1, Explanation: "Полный граф: n(n-1)/2 = 4*3/2 = 6.", TimeLimitSeconds: 50, Difficulty: 1},
	{ID: "q9-8", Grade: 9, Topic: "Алгоритмы", Text: "Имеется список [5, 3, 8, 1, 2]. После одного прохода пузырьковой сортировки по возрастанию каким станет последний элемент?", Options: []string{"5", "8", "1", "2"}, CorrectAnswer: 1, Explanation: "Самый большой элемент 8 «всплывёт» в конец.", TimeLimitSeconds: 50, Difficulty: 1},
	{ID: "q9-9", Grade: 9, Topic: "Логика", Text: "В языке запросов: & – И, | – ИЛИ. Запрос (кошки & собаки) | (кошки & птицы) выдал 50 страниц. Запрос кошки & (собаки | птицы) выдал 50 страниц. Равны ли результаты?", Options: []string{"Да, всегда", "Нет, могут отличаться", "Только если нет птиц", "Зависит от поисковика"}, CorrectAnswer: 0, Explanation: "По распределительному закону (A&B)|(A&C) = A&(B|C). Результаты одинаковы.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q9-10", Grade: 9, Topic: "Кодирование", Text: "Файл содержит ровно 64 символа, каждый кодируется одинаковым целым числом байт. Размер файла 128 байт. Сколько бит на символ?", Options: []string{"8", "16", "32", "4"}, CorrectAnswer: 1, Explanation: "128 байт / 64 символа = 2 байта на символ = 16 бит.", TimeLimitSeconds: 60, Difficulty: 1},
	{ID: "q9-11", Grade: 9, Topic: "Алгоритмы", Text: "Алгоритм: x=1; для i от 1 до 4: x=x*2+i. Чему равен x?", Options: []string{"31", "42", "38", "26"}, CorrectAnswer: 1, Explanation: "x=1*2+1=3; 3*2+2=8; 8*2+3=19; 19*2+4=42.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q9-12", Grade: 9, Topic: "Логика", Text: "Высказывание A истинно, B ложно. Какое выражение ложно?", Options: []string{"A ИЛИ B", "НЕ B", "A И B", "A И НЕ B"}, CorrectAnswer: 2, Explanation: "A и B = истина и ложь = ложь.", TimeLimitSeconds: 40, Difficulty: 1},

	// ================== 10 КЛАСС ==================
	{ID: "q10-1", Grade: 10, Topic: "Логика", Text: "Даны утверждения: «Если сервер работает, то сайт доступен». Сайт недоступен. Что можно сказать о сервере?", Options: []string{"Сервер не работает", "Сервер работает", "Ничего определённого", "Сервер перегружен"}, CorrectAnswer: 0, Explanation: "Из импликации A→B и ¬B следует ¬A (modus tollens).", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-2", Grade: 10, Topic: "Алгоритмы", Text: "Сколько сравнений в худшем случае потребуется, чтобы найти элемент в отсортированном массиве из 1024 элементов бинарным поиском?", Options: []string{"10", "11", "512", "1024"}, CorrectAnswer: 1, Explanation: "log₂(1024)=10, но худший случай – 11 сравнений, так как проверка последнего элемента.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-3", Grade: 10, Topic: "SQL", Text: "Что вернёт запрос SELECT COUNT(*) FROM users WHERE age > 18 GROUP BY city?", Options: []string{"Общее количество пользователей", "Количество пользователей старше 18 по городам", "Ошибку", "Список городов"}, CorrectAnswer: 1, Explanation: "GROUP BY city с агрегатной функцией COUNT подсчитает записи для каждого города отдельно.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q10-4", Grade: 10, Topic: "Сети", Text: "Устройство имеет IP 192.168.5.130/26. Какой адрес сети?", Options: []string{"192.168.5.0", "192.168.5.64", "192.168.5.128", "192.168.5.192"}, CorrectAnswer: 2, Explanation: "/26 даёт блоки по 64 адреса. Адрес 130 попадает в диапазон 128–191.", TimeLimitSeconds: 90, Difficulty: 3},
	{ID: "q10-5", Grade: 10, Topic: "Рекурсия", Text: "Функция f(n): если n=0 вернуть 0, иначе вернуть n+f(n-1). Чему равно f(5)?", Options: []string{"10", "15", "20", "25"}, CorrectAnswer: 1, Explanation: "Сумма 1+2+3+4+5 = 15.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q10-6", Grade: 10, Topic: "Безопасность", Text: "Какой метод лучше всего защищает пароли при утечке базы данных?", Options: []string{"Хранить открытым текстом", "Шифровать одним общим ключом", "Хранить salted hash (bcrypt/argon2)", "Кодировать в Base64"}, CorrectAnswer: 2, Explanation: "Солёный хеш стойкой функцией делает подбор неэффективным даже при утечке.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-7", Grade: 10, Topic: "Сложность", Text: "Два вложенных цикла: внешний выполняется n раз, внутренний — n/2 раз. Какова асимптотика общего числа операций?", Options: []string{"O(n)", "O(log n)", "O(n²)", "O(2ⁿ)"}, CorrectAnswer: 2, Explanation: "n * (n/2) = n²/2, константа не влияет, O(n²).", TimeLimitSeconds: 50, Difficulty: 2},
	{ID: "q10-8", Grade: 10, Topic: "Логика", Text: "Упростите: (A И НЕ B) ИЛИ (A И B).", Options: []string{"A", "B", "A И B", "A ИЛИ B"}, CorrectAnswer: 0, Explanation: "A & (!B | B) = A & 1 = A.", TimeLimitSeconds: 55, Difficulty: 1},
	{ID: "q10-9", Grade: 10, Topic: "Кодирование", Text: "Сообщение из 100 символов алфавита мощностью 32 записано без избыточности. Каков его минимальный размер в битах?", Options: []string{"320", "400", "500", "800"}, CorrectAnswer: 2, Explanation: "5 бит на символ (2^5=32). 100*5=500 бит.", TimeLimitSeconds: 55, Difficulty: 2},
	{ID: "q10-10", Grade: 10, Topic: "Алгоритмы", Text: "Постфиксное выражение: 5 2 3 * + 4 −. Чему равен результат?", Options: []string{"3", "7", "9", "15"}, CorrectAnswer: 1, Explanation: "2*3=6, 5+6=11, 11−4=7.", TimeLimitSeconds: 75, Difficulty: 2},
	{ID: "q10-11", Grade: 10, Topic: "Логика", Text: "Вы разрабатываете систему: доступ разрешён, если (роль admin ИЛИ роль moderator) И (НЕ заблокирован). Кто пройдёт: admin, заблокирован?", Options: []string{"Да", "Нет", "Зависит от пароля", "Только moderator"}, CorrectAnswer: 1, Explanation: "(true OR false) AND (NOT true) = true AND false = false.", TimeLimitSeconds: 55, Difficulty: 1},
	{ID: "q10-12", Grade: 10, Topic: "Структуры данных", Text: "В стек кладут числа: 1, 2, 3, затем дважды извлекают. Какое число останется на вершине?", Options: []string{"1", "2", "3", "Стек пуст"}, CorrectAnswer: 0, Explanation: "После push: [1,2,3] (вершина 3). pop → 3, pop → 2. Остался [1], вершина 1.", TimeLimitSeconds: 50, Difficulty: 1},

	// ================== 11 КЛАСС ==================
	{ID: "q11-1", Grade: 11, Topic: "Динамическое программирование", Text: "Сколькими способами можно подняться на лестницу из 5 ступенек, если за шаг можно подняться на 1 или 2 ступеньки?", Options: []string{"5", "8", "10", "13"}, CorrectAnswer: 1, Explanation: "Числа Фибоначчи: f(1)=1, f(2)=2, f(3)=3, f(4)=5, f(5)=8.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q11-2", Grade: 11, Topic: "Графы", Text: "Какой алгоритм лучше всего найти кратчайший путь от одной вершины до всех остальных в графе с неотрицательными весами?", Options: []string{"DFS", "BFS", "Дейкстры", "Флойда-Уоршелла"}, CorrectAnswer: 2, Explanation: "Алгоритм Дейкстры специально для кратчайших путей из одной вершины.", TimeLimitSeconds: 50, Difficulty: 1},
	{ID: "q11-3", Grade: 11, Topic: "Параллелизм", Text: "Два потока одновременно увеличивают общий счётчик (counter++) без блокировок. Какая проблема наиболее вероятна?", Options: []string{"SQL-инъекция", "Гонка данных (race condition)", "Утечка памяти", "Переполнение стека"}, CorrectAnswer: 1, Explanation: "Операция инкремента не атомарна, возникает состояние гонки.", TimeLimitSeconds: 55, Difficulty: 2},
	{ID: "q11-4", Grade: 11, Topic: "Базы данных", Text: "Что такое 3-я нормальная форма (3NF)?", Options: []string{"Все атрибуты зависят только от первичного ключа и нет транзитивных зависимостей", "Все поля числовые", "Нет повторяющихся строк", "Таблица имеет один столбец"}, CorrectAnswer: 0, Explanation: "3NF устраняет транзитивные зависимости неключевых атрибутов от ключа.", TimeLimitSeconds: 75, Difficulty: 3},
	{ID: "q11-5", Grade: 11, Topic: "Алгоритмы", Text: "Какой результат даст выражение sorted({3,1,2,3,2}) в Python?", Options: []string{"[3,1,2,3,2]", "[1,2,3]", "{1,2,3}", "[1,2,2,3,3]"}, CorrectAnswer: 1, Explanation: "Множество удаляет дубликаты, sorted возвращает отсортированный список.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q11-6", Grade: 11, Topic: "Вероятность", Text: "Хеш-функция равномерно распределяет ключи по 100 ячейкам. Какова вероятность того, что конкретный ключ попадёт в заданную ячейку?", Options: []string{"1/10", "1/50", "1/100", "1/10000"}, CorrectAnswer: 2, Explanation: "При равномерном распределении каждая из 100 ячеек имеет вероятность 1/100.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q11-7", Grade: 11, Topic: "Криптография", Text: "Какое свойство криптографической хеш-функции гарантирует, что по хешу невозможно восстановить исходные данные?", Options: []string{"Коллизионная стойкость", "Стойкость к прообразу (preimage resistance)", "Быстрое вычисление", "Детерминированность"}, CorrectAnswer: 1, Explanation: "Preimage resistance означает вычислительную невозможность нахождения прообраза.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q11-8", Grade: 11, Topic: "Логика", Text: "Функция F(A,B,C) = (A И B) ИЛИ (НЕ A И C). При каких значениях A,B,C она истинна?", Options: []string{"A=1,B=0,C=1", "A=0,B=0,C=0", "A=1,B=1,C=0", "A=0,B=0,C=1"}, CorrectAnswer: 2, Explanation: "При A=1,B=1 даёт 1 независимо от C.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q11-9", Grade: 11, Topic: "Алгоритмы", Text: "Для сортировки массива из миллиона целых чисел в диапазоне от 0 до 1000 лучший по времени алгоритм?", Options: []string{"Быстрая сортировка", "Сортировка подсчётом", "Пузырьковая сортировка", "Сортировка слиянием"}, CorrectAnswer: 1, Explanation: "При малом диапазоне ключей эффективнее всего сортировка подсчётом (O(n)).", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q11-10", Grade: 11, Topic: "Транзакции", Text: "Две транзакции читают одно и то же значение счёта (100), увеличивают на 50 и записывают обратно. Какая аномалия произошла?", Options: []string{"Грязное чтение", "Фантомное чтение", "Потерянное обновление", "Дедлок"}, CorrectAnswer: 2, Explanation: "Каждая перезаписывает результат другой, итоговое значение 150 вместо 200.", TimeLimitSeconds: 65, Difficulty: 3},
	{ID: "q11-11", Grade: 11, Topic: "Сети", Text: "Какой протокол используется для надёжной передачи данных в Интернете?", Options: []string{"HTTP", "FTP", "TCP", "UDP"}, CorrectAnswer: 2, Explanation: "TCP гарантирует доставку и порядок пакетов.", TimeLimitSeconds: 40, Difficulty: 1},
	{ID: "q11-12", Grade: 11, Topic: "Логика", Text: "Пусть есть правило: «Если пользователь авторизован и не заблокирован, то ему разрешён доступ». Пользователь авторизован, но доступ запрещён. Что обязательно истинно?", Options: []string{"Пользователь заблокирован", "Пользователь не авторизован", "Пользователь админ", "Сбой системы"}, CorrectAnswer: 0, Explanation: "Из посылки (A ∧ ¬B) → C и ¬C следует, что A ∧ ¬B ложно; так как A истинно, ¬B должно быть ложным, т.е. B истинно.", TimeLimitSeconds: 75, Difficulty: 3},
}

var tasks = []models.TerminalTask{
	{ID: "py-1", Title: "Чётные числа", Description: "Напишите Python-выражение, которое возвращает список чётных чисел из nums.", Language: "python", StarterCode: "nums = [1, 2, 3, 4, 5, 6]\nresult = ...", AcceptedAnswers: []string{"[x for x in nums if x % 2 == 0]", "[x for x in nums if x%2==0]"}, Reward: 260, Difficulty: 2},
	{ID: "py-2", Title: "Проверка палиндрома", Description: "Допишите выражение, которое проверяет, является ли строка s палиндромом.", Language: "python", StarterCode: "s = input().strip()\nis_palindrome = ...", AcceptedAnswers: []string{"s == s[::-1]", "s==s[::-1]"}, Reward: 220, Difficulty: 1},
	{ID: "py-3", Title: "Частоты", Description: "Напишите одну строку Python, создающую словарь частот символов строки s.", Language: "python", StarterCode: "s = 'abracadabra'\nfreq = ...", AcceptedAnswers: []string{"{c: s.count(c) for c in set(s)}", "{c:s.count(c) for c in set(s)}"}, Reward: 320, Difficulty: 3},
	{ID: "sql-1", Title: "Лучшие результаты", Description: "Выведите name и score трёх игроков с максимальным score из таблицы players.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT name, score FROM players ORDER BY score DESC LIMIT 3", "select name,score from players order by score desc limit 3"}, Reward: 260, Difficulty: 2},
	{ID: "sql-2", Title: "Средний балл класса", Description: "Выведите class и средний score для каждого класса из таблицы results.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT class, AVG(score) FROM results GROUP BY class", "select class,avg(score) from results group by class"}, Reward: 300, Difficulty: 2},
	{ID: "py-4", Title: "Бинарный поиск", Description: "Какое условие цикла используется в классическом бинарном поиске по индексам left и right?", Language: "python", StarterCode: "while ...:\n    mid = (left + right) // 2", AcceptedAnswers: []string{"left <= right", "left<=right"}, Reward: 180, Difficulty: 1},
	{ID: "py-5", Title: "Префиксные суммы", Description: "Допишите строку внутри цикла, чтобы prefix хранил префиксные суммы массива nums.", Language: "python", StarterCode: "prefix = [0]\nfor x in nums:\n    ...", AcceptedAnswers: []string{"prefix.append(prefix[-1] + x)", "prefix.append(prefix[-1]+x)"}, Reward: 340, Difficulty: 2},
	{ID: "py-6", Title: "Алгоритм Евклида", Description: "Допишите одну строку обновления a и b в цикле вычисления НОД.", Language: "python", StarterCode: "while b:\n    ...\nprint(a)", AcceptedAnswers: []string{"a, b = b, a % b", "a,b=b,a%b"}, Reward: 360, Difficulty: 2},
	{ID: "py-7", Title: "Уникальные с сохранением порядка", Description: "Получите список уникальных элементов items, сохранив порядок первого появления.", Language: "python", StarterCode: "items = [3, 1, 3, 2, 1]\nunique = ...", AcceptedAnswers: []string{"list(dict.fromkeys(items))"}, Reward: 380, Difficulty: 3},
	{ID: "py-8", Title: "Второй максимум", Description: "Одним выражением найдите второй по величине различный элемент nums.", Language: "python", StarterCode: "nums = [5, 1, 5, 4, 3]\nsecond = ...", AcceptedAnswers: []string{"sorted(set(nums))[-2]"}, Reward: 350, Difficulty: 2},
	{ID: "py-9", Title: "Очередь BFS", Description: "Допишите извлечение следующей вершины из deque queue в обходе в ширину.", Language: "python", StarterCode: "from collections import deque\nqueue = deque([start])\nwhile queue:\n    v = ...", AcceptedAnswers: []string{"queue.popleft()"}, Reward: 330, Difficulty: 2},
	{ID: "py-10", Title: "Мемоизация", Description: "Укажите декоратор functools, который кэширует результаты рекурсивной функции без ограничения размера.", Language: "python", StarterCode: "from functools import lru_cache\n...\ndef f(n):\n    return n if n < 2 else f(n-1) + f(n-2)", AcceptedAnswers: []string{"@lru_cache(None)", "@lru_cache(maxsize=None)"}, Reward: 420, Difficulty: 3},
	{ID: "py-11", Title: "Транспонирование матрицы", Description: "Одним выражением получите транспонированную матрицу в виде списка списков.", Language: "python", StarterCode: "matrix = [[1,2,3],[4,5,6]]\ntransposed = ...", AcceptedAnswers: []string{"[list(row) for row in zip(*matrix)]"}, Reward: 430, Difficulty: 3},
	{ID: "py-12", Title: "Скользящее окно", Description: "Допишите обновление суммы окна после сдвига вправо на один элемент.", Language: "python", StarterCode: "window_sum = sum(a[:k])\nfor i in range(k, len(a)):\n    window_sum = ...", AcceptedAnswers: []string{"window_sum + a[i] - a[i-k]", "window_sum+a[i]-a[i-k]"}, Reward: 440, Difficulty: 3},
	{ID: "sql-3", Title: "Группы с высоким средним", Description: "Выведите class и AVG(score), оставив только классы со средним выше 80.", Language: "sql", StarterCode: "SELECT ... FROM results ...", AcceptedAnswers: []string{"SELECT class, AVG(score) FROM results GROUP BY class HAVING AVG(score) > 80", "select class,avg(score) from results group by class having avg(score)>80"}, Reward: 380, Difficulty: 3},
	{ID: "sql-4", Title: "Заказы пользователей", Description: "Выведите users.name и orders.total, соединив users и orders по users.id = orders.user_id.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT users.name, orders.total FROM users JOIN orders ON users.id = orders.user_id", "select users.name,orders.total from users join orders on users.id=orders.user_id"}, Reward: 390, Difficulty: 3},
	{ID: "sql-5", Title: "Пользователи без заказов", Description: "Выведите имена пользователей, у которых нет ни одного заказа.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT users.name FROM users LEFT JOIN orders ON users.id = orders.user_id WHERE orders.id IS NULL", "select users.name from users left join orders on users.id=orders.user_id where orders.id is null"}, Reward: 460, Difficulty: 3},
	{ID: "sql-6", Title: "Повторяющиеся email", Description: "Выведите email, встречающиеся в таблице users более одного раза.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT email FROM users GROUP BY email HAVING COUNT(*) > 1", "select email from users group by email having count(*)>1"}, Reward: 400, Difficulty: 3},
	{ID: "sql-7", Title: "Ранг по баллам", Description: "Выведите name, score и ранг по убыванию score с помощью оконной функции RANK.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT name, score, RANK() OVER (ORDER BY score DESC) FROM players", "select name,score,rank() over(order by score desc) from players"}, Reward: 500, Difficulty: 3},
}

func All() []models.Question { return append([]models.Question(nil), bank...) }
func ForGrade(grade int) []models.Question {
	if grade < 9 || grade > 11 {
		return All()
	}
	out := make([]models.Question, 0)
	for _, q := range bank {
		if q.Grade == grade {
			out = append(out, q)
		}
	}
	return out
}
func Tasks() []models.TerminalTask { return append([]models.TerminalTask(nil), tasks...) }
