package questions

import "ggame/backend/internal/models"

var bank = []models.Question{
	{ID: "q9-1", Grade: 9, Topic: "Алгоритмы", Text: "Алгоритм выполняет: x=1; для i от 1 до 4: x=x*2+i. Чему равен x?", Options: []string{"31", "42", "38", "26"}, CorrectAnswer: 1, Explanation: "Последовательно получаем 3, 8, 19 и 42.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q9-2", Grade: 9, Topic: "Логика", Text: "Высказывание A истинно, B ложно. Какое выражение ложно?", Options: []string{"A ИЛИ B", "НЕ B", "A И B", "A И НЕ B"}, CorrectAnswer: 2, Explanation: "Конъюнкция A И B ложна, потому что B ложно.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q9-3", Grade: 9, Topic: "Системы счисления", Text: "Какое десятичное число соответствует двоичному 101101?", Options: []string{"43", "45", "46", "53"}, CorrectAnswer: 1, Explanation: "32+8+4+1=45.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q9-4", Grade: 9, Topic: "Графы", Text: "В полном графе 6 вершин. Сколько в нём рёбер?", Options: []string{"12", "15", "18", "30"}, CorrectAnswer: 1, Explanation: "В полном графе n(n−1)/2 рёбер: 6·5/2=15.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q9-5", Grade: 9, Topic: "Кодирование", Text: "Сообщение состоит из 80 символов алфавита мощностью 16. Каков минимальный объём в битах?", Options: []string{"160", "240", "320", "640"}, CorrectAnswer: 2, Explanation: "На символ нужно log2(16)=4 бита, всего 80·4=320.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q9-6", Grade: 9, Topic: "Трассировка", Text: "Список [3,1,4,1,5]. После одного полного прохода пузырьковой сортировки по возрастанию каким станет последний элемент?", Options: []string{"1", "3", "4", "5"}, CorrectAnswer: 3, Explanation: "За один проход максимальный элемент 5 всплывает в конец.", TimeLimitSeconds: 50, Difficulty: 2},
	{ID: "q9-7", Grade: 9, Topic: "Трассировка", Text: "x=0. Для i от 1 до 5: если i чётное, x=x+i, иначе x=x−i. Чему равен x?", Options: []string{"−3", "3", "−5", "5"}, CorrectAnswer: 0, Explanation: "Получаем −1+2−3+4−5=−3.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q9-8", Grade: 9, Topic: "Логика", Text: "Какое выражение истинно ровно тогда, когда истинно ровно одно из A и B?", Options: []string{"A И B", "A ИЛИ B", "(A ИЛИ B) И НЕ(A И B)", "НЕ A И НЕ B"}, CorrectAnswer: 2, Explanation: "Это исключающее ИЛИ: хотя бы одно истинно, но не оба сразу.", TimeLimitSeconds: 70, Difficulty: 3},
	{ID: "q9-9", Grade: 9, Topic: "Кодирование", Text: "Файл содержит 64 символа алфавита мощностью 32. Каков минимальный информационный объём без служебных данных?", Options: []string{"256 бит", "320 бит", "384 бит", "2048 бит"}, CorrectAnswer: 1, Explanation: "Один символ кодируется 5 битами, поэтому 64·5=320 бит.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q9-10", Grade: 9, Topic: "Графы", Text: "Связный граф без циклов содержит 12 вершин. Сколько в нём рёбер?", Options: []string{"10", "11", "12", "22"}, CorrectAnswer: 1, Explanation: "Любое дерево на n вершинах содержит n−1 ребро.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q9-11", Grade: 9, Topic: "Системы счисления", Text: "Чему равна сумма 10110₂ + 17₈ в десятичной системе?", Options: []string{"35", "36", "37", "39"}, CorrectAnswer: 2, Explanation: "10110₂=22, 17₈=15, сумма равна 37.", TimeLimitSeconds: 75, Difficulty: 3},
	{ID: "q9-12", Grade: 9, Topic: "Поиск", Text: "Бинарный поиск работает с индексами left=0 и right=14. Какой индекс будет проверен первым при mid=(left+right)//2?", Options: []string{"6", "7", "8", "14"}, CorrectAnswer: 1, Explanation: "(0+14)//2=7.", TimeLimitSeconds: 45, Difficulty: 1},

	{ID: "q10-1", Grade: 10, Topic: "Сложность", Text: "Два вложенных цикла выполняются n и n/2 раз. Какая асимптотика числа операций?", Options: []string{"O(n)", "O(log n)", "O(n²)", "O(2ⁿ)"}, CorrectAnswer: 2, Explanation: "n·(n/2)=n²/2, постоянный множитель не влияет на O(n²).", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-2", Grade: 10, Topic: "Поиск", Text: "В отсортированном массиве 1024 элементов сколько сравнений в худшем случае нужно бинарному поиску?", Options: []string{"10", "11", "512", "1024"}, CorrectAnswer: 1, Explanation: "Нужно до floor(log2(1024))+1 = 11 сравнений.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-3", Grade: 10, Topic: "SQL", Text: "Какой запрос вернёт число учеников в каждом классе?", Options: []string{"SELECT class, COUNT(*) FROM students GROUP BY class", "SELECT COUNT(class) FROM students", "SELECT class FROM students ORDER BY class", "SELECT DISTINCT COUNT(*) FROM students"}, CorrectAnswer: 0, Explanation: "Для подсчёта по группам нужны COUNT(*) и GROUP BY class.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q10-4", Grade: 10, Topic: "Сети", Text: "Устройство имеет адрес 192.168.5.130/26. Какой адрес сети?", Options: []string{"192.168.5.0", "192.168.5.64", "192.168.5.128", "192.168.5.192"}, CorrectAnswer: 2, Explanation: "При /26 блоки по 64 адреса; 130 попадает в диапазон 128–191.", TimeLimitSeconds: 80, Difficulty: 3},
	{ID: "q10-5", Grade: 10, Topic: "Рекурсия", Text: "Функция f(n): если n=0 вернуть 0, иначе вернуть n+f(n-1). Чему равно f(5)?", Options: []string{"10", "15", "20", "25"}, CorrectAnswer: 1, Explanation: "Это сумма 1+2+3+4+5=15.", TimeLimitSeconds: 50, Difficulty: 1},
	{ID: "q10-6", Grade: 10, Topic: "Безопасность", Text: "Какой вариант лучше всего защищает пароль, если база утечёт?", Options: []string{"Хранить открытым текстом", "Шифровать одним общим ключом", "Хранить salted hash медленной функцией", "Кодировать Base64"}, CorrectAnswer: 2, Explanation: "Salted hash с Argon2/bcrypt/scrypt затрудняет перебор и радужные таблицы.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-7", Grade: 10, Topic: "Рекурсия", Text: "Наивная функция Fibonacci вызывает fib(n−1) и fib(n−2) без мемоизации. Какая оценка времени ближе всего?", Options: []string{"O(1)", "O(log n)", "O(n)", "O(2ⁿ)"}, CorrectAnswer: 3, Explanation: "Дерево рекурсивных вызовов растёт экспоненциально.", TimeLimitSeconds: 70, Difficulty: 2},
	{ID: "q10-8", Grade: 10, Topic: "Сети", Text: "Сколько пригодных для узлов IPv4-адресов обычно содержит подсеть /27?", Options: []string{"14", "30", "32", "62"}, CorrectAnswer: 1, Explanation: "Всего 32 адреса, два обычно заняты адресом сети и broadcast: остаётся 30.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q10-9", Grade: 10, Topic: "SQL", Text: "Как отфильтровать группы после GROUP BY, оставив только классы со средним баллом выше 80?", Options: []string{"WHERE AVG(score)>80", "HAVING AVG(score)>80", "ORDER BY AVG(score)>80", "LIMIT AVG(score)>80"}, CorrectAnswer: 1, Explanation: "Условия на агрегаты задаются в HAVING.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q10-10", Grade: 10, Topic: "Стек", Text: "Чему равно значение постфиксного выражения: 5 2 3 * + 4 − ?", Options: []string{"3", "7", "9", "15"}, CorrectAnswer: 1, Explanation: "2·3=6, затем 5+6=11, затем 11−4=7.", TimeLimitSeconds: 80, Difficulty: 3},
	{ID: "q10-11", Grade: 10, Topic: "Булева алгебра", Text: "Как упрощается выражение A И (A ИЛИ B)?", Options: []string{"A", "B", "A И B", "A ИЛИ B"}, CorrectAnswer: 0, Explanation: "По закону поглощения A∧(A∨B)=A.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q10-12", Grade: 10, Topic: "Сортировки", Text: "Какой алгоритм гарантирует O(n log n) и является устойчивым в классической реализации?", Options: []string{"Пузырьковая сортировка", "Сортировка выбором", "Сортировка слиянием", "Быстрая сортировка всегда"}, CorrectAnswer: 2, Explanation: "Сортировка слиянием устойчива и гарантирует O(n log n).", TimeLimitSeconds: 60, Difficulty: 2},

	{ID: "q11-1", Grade: 11, Topic: "Динамическое программирование", Text: "Сколькими способами можно подняться на 5 ступеней, делая шаг на 1 или 2 ступени?", Options: []string{"5", "8", "10", "13"}, CorrectAnswer: 1, Explanation: "Количество способов образует последовательность Фибоначчи: 1,2,3,5,8.", TimeLimitSeconds: 75, Difficulty: 2},
	{ID: "q11-2", Grade: 11, Topic: "Графы", Text: "Для поиска кратчайших путей из одной вершины в графе с неотрицательными весами обычно применяют...", Options: []string{"DFS", "Дейкстру", "Флойда только", "Топологическую сортировку"}, CorrectAnswer: 1, Explanation: "Алгоритм Дейкстры решает задачу при неотрицательных весах.", TimeLimitSeconds: 50, Difficulty: 1},
	{ID: "q11-3", Grade: 11, Topic: "Параллелизм", Text: "Два потока одновременно увеличивают общий счётчик без блокировки. Какая ошибка наиболее вероятна?", Options: []string{"SQL-инъекция", "Гонка данных", "Утечка DNS", "Переполнение стека обязательно"}, CorrectAnswer: 1, Explanation: "Операция чтение-изменение-запись не атомарна и приводит к data race.", TimeLimitSeconds: 50, Difficulty: 2},
	{ID: "q11-4", Grade: 11, Topic: "Базы данных", Text: "Таблица находится в 3НФ. Какое утверждение наиболее близко к определению?", Options: []string{"Нет повторяющихся строк", "Каждый неключевой атрибут зависит только от ключа и не зависит транзитивно", "Все поля числовые", "У таблицы один столбец"}, CorrectAnswer: 1, Explanation: "3НФ устраняет транзитивные зависимости неключевых атрибутов от ключа.", TimeLimitSeconds: 75, Difficulty: 3},
	{ID: "q11-5", Grade: 11, Topic: "Алгоритмы", Text: "Какой результат даст выражение sorted({3,1,2,3,2}) в Python?", Options: []string{"[3,1,2,3,2]", "[1,2,3]", "{1,2,3}", "[1,2,2,3,3]"}, CorrectAnswer: 1, Explanation: "Множество удаляет повторы, sorted возвращает отсортированный список.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q11-6", Grade: 11, Topic: "Вероятность", Text: "Хеш-функция равномерно распределяет ключи по 100 ячейкам. Какова вероятность попадания одного ключа в конкретную ячейку?", Options: []string{"1/10", "1/50", "1/100", "1/10000"}, CorrectAnswer: 2, Explanation: "При равномерном распределении каждая из 100 ячеек имеет вероятность 1/100.", TimeLimitSeconds: 45, Difficulty: 1},
	{ID: "q11-7", Grade: 11, Topic: "Графы", Text: "Почему алгоритм Дейкстры нельзя напрямую применять к графу с отрицательными рёбрами?", Options: []string{"Он работает только с деревьями", "Уже зафиксированное расстояние может позже уменьшиться", "Он требует ориентированный граф", "Он не использует очередь"}, CorrectAnswer: 1, Explanation: "Отрицательное ребро может улучшить путь к уже обработанной вершине.", TimeLimitSeconds: 80, Difficulty: 3},
	{ID: "q11-8", Grade: 11, Topic: "Динамическое программирование", Text: "Какой объём памяти нужен для таблицы dp[i][w] в классической задаче о рюкзаке для n предметов и вместимости W?", Options: []string{"O(1)", "O(n+W)", "O(nW)", "O(2ⁿ)"}, CorrectAnswer: 2, Explanation: "Таблица содержит примерно n·W состояний.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q11-9", Grade: 11, Topic: "Транзакции", Text: "Две транзакции читают одно значение, обе увеличивают его и записывают. Одна прибавка исчезает. Как называется аномалия?", Options: []string{"Грязное чтение", "Фантомное чтение", "Потерянное обновление", "Дедлок"}, CorrectAnswer: 2, Explanation: "Последняя запись перезаписывает результат другой транзакции — это lost update.", TimeLimitSeconds: 70, Difficulty: 3},
	{ID: "q11-10", Grade: 11, Topic: "Криптография", Text: "Какое свойство криптографической хеш-функции означает сложность восстановления сообщения по хешу?", Options: []string{"Обратимость", "Стойкость к нахождению прообраза", "Сжатие без потерь", "Симметричность"}, CorrectAnswer: 1, Explanation: "Preimage resistance означает вычислительную трудность найти вход по заданному хешу.", TimeLimitSeconds: 65, Difficulty: 2},
	{ID: "q11-11", Grade: 11, Topic: "Графы", Text: "Что обязательно верно, если ориентированный граф допускает топологическую сортировку?", Options: []string{"Он связный", "В нём нет ориентированных циклов", "Все веса положительные", "У каждой вершины степень 2"}, CorrectAnswer: 1, Explanation: "Топологический порядок существует тогда и только тогда, когда граф ацикличен.", TimeLimitSeconds: 60, Difficulty: 2},
	{ID: "q11-12", Grade: 11, Topic: "Хеширование", Text: "Два разных ключа получили один и тот же хеш. Что произошло?", Options: []string{"Переполнение стека", "Коллизия", "Дедлок", "Нормализация"}, CorrectAnswer: 1, Explanation: "Совпадение хешей разных ключей называется коллизией.", TimeLimitSeconds: 45, Difficulty: 1},
}

var tasks = []models.TerminalTask{
	{ID: "py-1", Title: "Чётные числа", Description: "Напишите Python-выражение, которое возвращает список чётных чисел из nums.", Language: "python", StarterCode: "nums = [1, 2, 3, 4, 5, 6]\nresult = ...", AcceptedAnswers: []string{"[x for x in nums if x % 2 == 0]", "[x for x in nums if x%2==0]"}, Reward: 260, Difficulty: 2},
	{ID: "py-2", Title: "Проверка палиндрома", Description: "Допишите выражение, которое проверяет, является ли строка s палиндромом.", Language: "python", StarterCode: "s = input().strip()\nis_palindrome = ...", AcceptedAnswers: []string{"s == s[::-1]", "s==s[::-1]"}, Reward: 220, Difficulty: 1},
	{ID: "py-3", Title: "Частоты", Description: "Напишите одну строку Python, создающую словарь частот символов строки s.", Language: "python", StarterCode: "s = 'abracadabra'\nfreq = ...", AcceptedAnswers: []string{"{c: s.count(c) for c in set(s)}", "{c:s.count(c) for c in set(s)}"}, Reward: 320, Difficulty: 3},
	{ID: "sql-1", Title: "Лучшие результаты", Description: "Выведите name и score трёх игроков с максимальным score из таблицы players.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT name, score FROM players ORDER BY score DESC LIMIT 3", "select name,score from players order by score desc limit 3"}, Reward: 260, Difficulty: 2},
	{ID: "sql-2", Title: "Средний балл класса", Description: "Выведите class и средний score для каждого класса из таблицы results.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT class, AVG(score) FROM results GROUP BY class", "select class,avg(score) from results group by class"}, Reward: 300, Difficulty: 2},
	{ID: "py-4", Title: "Бинарный поиск", Description: "Какое условие цикла используется в классическом бинарном поиске по индексам left и right?", Language: "python", StarterCode: "while ...:\n    mid = (left + right) // 2", AcceptedAnswers: []string{"left <= right", "left<=right"}, Reward: 180, Difficulty: 1},
	{ID: "py-5", Title: "Префиксные суммы", Description: "Допишите строку внутри цикла, чтобы prefix хранил префиксные суммы массива nums.", Language: "python", StarterCode: "prefix = [0]\nfor x in nums:\n    ...", AcceptedAnswers: []string{"prefix.append(prefix[-1] + x)", "prefix.append(prefix[-1]+x)"}, Reward: 340, Difficulty: 2},
	{ID: "py-6", Title: "Алгоритм Евклида", Description: "Допишите одну строку обновления a и b в цикле вычисления НОД.", Language: "python", StarterCode: "while b:\n    ...\nprint(a)", AcceptedAnswers: []string{"a, b = b, a % b", "a,b=b,a%b"}, Reward: 360, Difficulty: 2},
	{ID: "py-7", Title: "Уникальные с сохранением порядка", Description: "Получите список уникальных элементов items, сохранив порядок первого появления.", Language: "python", StarterCode: "items = [3, 1, 3, 2, 1]\nunique = ...", AcceptedAnswers: []string{"list(dict.fromkeys(items))"}, Reward: 380, Difficulty: 3},
	{ID: "py-8", Title: "Второй максимум", Description: "Одним выражением найдите второй по величине различный элемент nums.", Language: "python", StarterCode: "nums = [5, 1, 5, 4, 3]\nsecond = ...", AcceptedAnswers: []string{"sorted(set(nums))[-2]"}, Reward: 350, Difficulty: 2},
	{ID: "py-9", Title: "Очередь BFS", Description: "Допишите извлечение следующей вершины из deque queue в обходе в ширину.", Language: "python", StarterCode: "from collections import deque\nqueue = deque([start])\nwhile queue:\n    v = ...", AcceptedAnswers: []string{"queue.popleft()"}, Reward: 330, Difficulty: 2},
	{ID: "py-10", Title: "Мемоизация", Description: "Укажите декоратор functools, который кэширует результаты рекурсивной функции без ограничения размера.", Language: "python", StarterCode: "from functools import lru_cache\n...\ndef f(n):\n    return n if n < 2 else f(n-1) + f(n-2)", AcceptedAnswers: []string{"@lru_cache(None)", "@lru_cache(maxsize=None)"}, Reward: 420, Difficulty: 3},
	{ID: "py-11", Title: "Транспонирование матрицы", Description: "Одним выражением получите транспонированную матрицу в виде списка списков.", Language: "python", StarterCode: "matrix = [[1,2,3],[4,5,6]]\ntransposed = ...", AcceptedAnswers: []string{"[list(row) for row in zip(*matrix)]"}, Reward: 430, Difficulty: 3},
	{ID: "py-12", Title: "Скользящее окно", Description: "Допишите обновление суммы окна после сдвига вправо на один элемент.", Language: "python", StarterCode: "window_sum = sum(a[:k])\nfor i in range(k, len(a)):\n    window_sum = ...", AcceptedAnswers: []string{"window_sum + a[i] - a[i-k]", "window_sum+a[i]-a[i-k]"}, Reward: 440, Difficulty: 3},
	{ID: "sql-3", Title: "Группы с высоким средним", Description: "Выведите class и AVG(score), оставив только классы со средним выше 80.", Language: "sql", StarterCode: "SELECT ... FROM results ...", AcceptedAnswers: []string{"SELECT class, AVG(score) FROM results GROUP BY class HAVING AVG(score) > 80", "select class,avg(score) from results group by class having avg(score)>80"}, Reward: 380, Difficulty: 3},
	{ID: "sql-4", Title: "Заказы пользователей", Description: "Выведите users.name и orders.total, соединив users и orders по users.id = orders.user_id.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT users.name, orders.total FROM users JOIN orders ON users.id = orders.user_id", "select users.name,orders.total from users join orders on users.id=orders.user_id"}, Reward: 390, Difficulty: 3},
	{ID: "sql-5", Title: "Пользователи без заказов", Description: "Выведите имена пользователей, у которых нет ни одного заказа.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT users.name FROM users LEFT JOIN orders ON users.id = orders.user_id WHERE orders.id IS NULL", "select users.name from users left join orders on users.id=orders.user_id where orders.id is null"}, Reward: 460, Difficulty: 3},
	{ID: "sql-6", Title: "Повторяющиеся email", Description: "Выведите email, встречающиеся в таблице users более одного раза.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT email FROM users GROUP BY email HAVING COUNT(*) > 1", "select email from users group by email having count(*)>1"}, Reward: 400, Difficulty: 3},
	{ID: "sql-7", Title: "Ранг по баллам", Description: "Выведите name, score и ранг по убыванию score с помощью оконной функции RANK.", Language: "sql", StarterCode: "SELECT ...", AcceptedAnswers: []string{"SELECT name, score, RANK() OVER (ORDER BY score DESC) FROM players", "select name,score,rank() over(order by score desc) from players"}, Reward: 500, Difficulty: 3},
}

func All() []models.Question { return append([]models.Question(nil), bank...) }
func ForGrade(grade int) []models.Question {
	if grade < 9 || grade > 11 {
		return All()
	}
	out := make([]models.Question, 0)
	for _, q := range bank {
		if q.Grade == grade {
			out = append(out, q)
		}
	}
	return out
}
func Tasks() []models.TerminalTask { return append([]models.TerminalTask(nil), tasks...) }
